RIOT-OS/RIOT/boards/pic32-wifire/include/p32mz2048efg100.h
extern volatile __REFO1TRIMbits_t REFO1TRIMbits __asm__ ("REFO1TRIM") __attribute__((section("sfrs")));
extern volatile unsigned int        REFO1TRIMCLR __attribute__((section("sfrs")));
extern volatile unsigned int        REFO1TRIMSET __attribute__((section("sfrs")));
extern volatile unsigned int        REFO1TRIMINV __attribute__((section("sfrs")));
#define REFO2CON REFO2CON
extern volatile unsigned int   REFO2CON __attribute__((section("sfrs")));
typedef struct {
  unsigned ROSEL:4;
  unsigned :4;
  unsigned ACTIVE:1;
  unsigned DIVSWEN:1;
  unsigned :1;
  unsigned RSLP:1;
  unsigned OE:1;
  unsigned SIDL:1;
  unsigned :1;
  unsigned ON:1;
  unsigned RODIV:15;
} __REFO2CONbits_t;
extern volatile __REFO2CONbits_t REFO2CONbits __asm__ ("REFO2CON") __attribute__((section("sfrs")));
extern volatile unsigned int        REFO2CONCLR __attribute__((section("sfrs")));
extern volatile unsigned int        REFO2CONSET __attribute__((section("sfrs")));
extern volatile unsigned int        REFO2CONINV __attribute__((section("sfrs")));
#define REFO2TRIM REFO2TRIM
extern volatile unsigned int   REFO2TRIM __attribute__((section("sfrs")));
typedef struct {
  unsigned :23;
  unsigned ROTRIM:9;
} __REFO2TRIMbits_t;
extern volatile __REFO2TRIMbits_t REFO2TRIMbits __asm__ ("REFO2TRIM") __attribute__((section("sfrs")));
extern volatile unsigned int        REFO2TRIMCLR __attribute__((section("sfrs")));
extern volatile unsigned int        REFO2TRIMSET __attribute__((section("sfrs")));
extern volatile unsigned int        REFO2TRIMINV __attribute__((section("sfrs")));
#define REFO3CON REFO3CON
extern volatile unsigned int   REFO3CON __attribute__((section("sfrs")));
typedef struct {
  unsigned ROSEL:4;
  unsigned :4;
  unsigned ACTIVE:1;
  unsigned DIVSWEN:1;
  unsigned :1;
  unsigned RSLP:1;
  unsigned OE:1;
  unsigned SIDL:1;
  unsigned :1;
  unsigned ON:1;
  unsigned RODIV:15;
} __REFO3CONbits_t;
extern volatile __REFO3CONbits_t REFO3CONbits __asm__ ("REFO3CON") __attribute__((section("sfrs")));
extern volatile unsigned int        REFO3CONCLR __attribute__((section("sfrs")));
extern volatile unsigned int        REFO3CONSET __attribute__((section("sfrs")));
extern volatile unsigned int        REFO3CONINV __attribute__((section("sfrs")));
#define REFO3TRIM REFO3TRIM
extern volatile unsigned int   REFO3TRIM __attribute__((section("sfrs")));
typedef struct {
  unsigned :23;
  unsigned ROTRIM:9;
} __REFO3TRIMbits_t;
extern volatile __REFO3TRIMbits_t REFO3TRIMbits __asm__ ("REFO3TRIM") __attribute__((section("sfrs")));
extern volatile unsigned int        REFO3TRIMCLR __attribute__((section("sfrs")));
extern volatile unsigned int        REFO3TRIMSET __attribute__((section("sfrs")));
extern volatile unsigned int        REFO3TRIMINV __attribute__((section("sfrs")));
#define REFO4CON REFO4CON
extern volatile unsigned int   REFO4CON __attribute__((section("sfrs")));
typedef struct {
  unsigned ROSEL:4;
  unsigned :4;
  unsigned ACTIVE:1;
  unsigned DIVSWEN:1;
  unsigned :1;
  unsigned RSLP:1;
  unsigned OE:1;
  unsigned SIDL:1;
  unsigned :1;
  unsigned ON:1;
  unsigned RODIV:15;
} __REFO4CONbits_t;
extern volatile __REFO4CONbits_t REFO4CONbits __asm__ ("REFO4CON") __attribute__((section("sfrs")));
extern volatile unsigned int        REFO4CONCLR __attribute__((section("sfrs")));
extern volatile unsigned int        REFO4CONSET __attribute__((section("sfrs")));
extern volatile unsigned int        REFO4CONINV __attribute__((section("sfrs")));
#define REFO4TRIM REFO4TRIM
extern volatile unsigned int   REFO4TRIM __attribute__((section("sfrs")));
typedef struct {
  unsigned :23;
  unsigned ROTRIM:9;
} __REFO4TRIMbits_t;
extern volatile __REFO4TRIMbits_t REFO4TRIMbits __asm__ ("REFO4TRIM") __attribute__((section("sfrs")));
extern volatile unsigned int        REFO4TRIMCLR __attribute__((section("sfrs")));
extern volatile unsigned int        REFO4TRIMSET __attribute__((section("sfrs")));
extern volatile unsigned int        REFO4TRIMINV __attribute__((section("sfrs")));
#define PB1DIV PB1DIV
extern volatile unsigned int   PB1DIV __attribute__((section("sfrs")));
typedef struct {
  unsigned PBDIV:7;
  unsigned :4;
  unsigned PBDIVRDY:1;
} __PB1DIVbits_t;
extern volatile __PB1DIVbits_t PB1DIVbits __asm__ ("PB1DIV") __attribute__((section("sfrs")));
extern volatile unsigned int        PB1DIVCLR __attribute__((section("sfrs")));
extern volatile unsigned int        PB1DIVSET __attribute__((section("sfrs")));
extern volatile unsigned int        PB1DIVINV __attribute__((section("sfrs")));
#define PB2DIV PB2DIV
extern volatile unsigned int   PB2DIV __attribute__((section("sfrs")));
typedef struct {
  unsigned PBDIV:7;
  unsigned :4;
  unsigned PBDIVRDY:1;
  unsigned :3;
  unsigned ON:1;
} __PB2DIVbits_t;
extern volatile __PB2DIVbits_t PB2DIVbits __asm__ ("PB2DIV") __attribute__((section("sfrs")));
extern volatile unsigned int        PB2DIVCLR __attribute__((section("sfrs")));
extern volatile unsigned int        PB2DIVSET __attribute__((section("sfrs")));
extern volatile unsigned int        PB2DIVINV __attribute__((section("sfrs")));
#define PB3DIV PB3DIV
extern volatile unsigned int   PB3DIV __attribute__((section("sfrs")));
typedef struct {
  unsigned PBDIV:7;
  unsigned :4;
  unsigned PBDIVRDY:1;
  unsigned :3;
  unsigned ON:1;
} __PB3DIVbits_t;
extern volatile __PB3DIVbits_t PB3DIVbits __asm__ ("PB3DIV") __attribute__((section("sfrs")));
extern volatile unsigned int        PB3DIVCLR __attribute__((section("sfrs")));
extern volatile unsigned int        PB3DIVSET __attribute__((section("sfrs")));
extern volatile unsigned int        PB3DIVINV __attribute__((section("sfrs")));
#define PB4DIV PB4DIV
extern volatile unsigned int   PB4DIV __attribute__((section("sfrs")));
typedef struct {
  unsigned PBDIV:7;
  unsigned :4;
  unsigned PBDIVRDY:1;
  unsigned :3;
  unsigned ON:1;
} __PB4DIVbits_t;
extern volatile __PB4DIVbits_t PB4DIVbits __asm__ ("PB4DIV") __attribute__((section("sfrs")));
extern volatile unsigned int        PB4DIVCLR __attribute__((section("sfrs")));
extern volatile unsigned int        PB4DIVSET __attribute__((section("sfrs")));
extern volatile unsigned int        PB4DIVINV __attribute__((section("sfrs")));
#define PB5DIV PB5DIV
extern volatile unsigned int   PB5DIV __attribute__((section("sfrs")));
typedef struct {
  unsigned PBDIV:7;
  unsigned :4;
  unsigned PBDIVRDY:1;
  unsigned :3;
  unsigned ON:1;
} __PB5DIVbits_t;
