RIOT-OS/RIOT/boards/pic32-wifire/include/p32mz2048efg100.h
extern volatile __T6CONbits_t T6CONbits __asm__ ("T6CON") __attribute__((section("sfrs")));
extern volatile unsigned int        T6CONCLR __attribute__((section("sfrs")));
extern volatile unsigned int        T6CONSET __attribute__((section("sfrs")));
extern volatile unsigned int        T6CONINV __attribute__((section("sfrs")));
#define TMR6 TMR6
extern volatile unsigned int   TMR6 __attribute__((section("sfrs")));
extern volatile unsigned int        TMR6CLR __attribute__((section("sfrs")));
extern volatile unsigned int        TMR6SET __attribute__((section("sfrs")));
extern volatile unsigned int        TMR6INV __attribute__((section("sfrs")));
#define PR6 PR6
extern volatile unsigned int   PR6 __attribute__((section("sfrs")));
extern volatile unsigned int        PR6CLR __attribute__((section("sfrs")));
extern volatile unsigned int        PR6SET __attribute__((section("sfrs")));
extern volatile unsigned int        PR6INV __attribute__((section("sfrs")));
#define T7CON T7CON
extern volatile unsigned int   T7CON __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :1;
    unsigned TCS:1;
    unsigned :2;
    unsigned TCKPS:3;
    unsigned TGATE:1;
    unsigned :5;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned :4;
    unsigned TCKPS0:1;
    unsigned TCKPS1:1;
    unsigned TCKPS2:1;
  };
  struct {
    unsigned :13;
    unsigned TSIDL:1;
    unsigned :1;
    unsigned TON:1;
  };
  struct {
    unsigned w:32;
  };
} __T7CONbits_t;
extern volatile __T7CONbits_t T7CONbits __asm__ ("T7CON") __attribute__((section("sfrs")));
extern volatile unsigned int        T7CONCLR __attribute__((section("sfrs")));
extern volatile unsigned int        T7CONSET __attribute__((section("sfrs")));
extern volatile unsigned int        T7CONINV __attribute__((section("sfrs")));
#define TMR7 TMR7
extern volatile unsigned int   TMR7 __attribute__((section("sfrs")));
extern volatile unsigned int        TMR7CLR __attribute__((section("sfrs")));
extern volatile unsigned int        TMR7SET __attribute__((section("sfrs")));
extern volatile unsigned int        TMR7INV __attribute__((section("sfrs")));
#define PR7 PR7
extern volatile unsigned int   PR7 __attribute__((section("sfrs")));
extern volatile unsigned int        PR7CLR __attribute__((section("sfrs")));
extern volatile unsigned int        PR7SET __attribute__((section("sfrs")));
extern volatile unsigned int        PR7INV __attribute__((section("sfrs")));
#define T8CON T8CON
extern volatile unsigned int   T8CON __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :1;
    unsigned TCS:1;
    unsigned :1;
    unsigned T32:1;
    unsigned TCKPS:3;
    unsigned TGATE:1;
    unsigned :5;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned :4;
    unsigned TCKPS0:1;
    unsigned TCKPS1:1;
    unsigned TCKPS2:1;
  };
  struct {
    unsigned :13;
    unsigned TSIDL:1;
    unsigned :1;
    unsigned TON:1;
  };
  struct {
    unsigned w:32;
  };
} __T8CONbits_t;
extern volatile __T8CONbits_t T8CONbits __asm__ ("T8CON") __attribute__((section("sfrs")));
extern volatile unsigned int        T8CONCLR __attribute__((section("sfrs")));
extern volatile unsigned int        T8CONSET __attribute__((section("sfrs")));
extern volatile unsigned int        T8CONINV __attribute__((section("sfrs")));
#define TMR8 TMR8
extern volatile unsigned int   TMR8 __attribute__((section("sfrs")));
extern volatile unsigned int        TMR8CLR __attribute__((section("sfrs")));
extern volatile unsigned int        TMR8SET __attribute__((section("sfrs")));
extern volatile unsigned int        TMR8INV __attribute__((section("sfrs")));
#define PR8 PR8
extern volatile unsigned int   PR8 __attribute__((section("sfrs")));
extern volatile unsigned int        PR8CLR __attribute__((section("sfrs")));
extern volatile unsigned int        PR8SET __attribute__((section("sfrs")));
extern volatile unsigned int        PR8INV __attribute__((section("sfrs")));
#define T9CON T9CON
extern volatile unsigned int   T9CON __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :1;
    unsigned TCS:1;
    unsigned :2;
    unsigned TCKPS:3;
    unsigned TGATE:1;
    unsigned :5;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned :4;
    unsigned TCKPS0:1;
    unsigned TCKPS1:1;
    unsigned TCKPS2:1;
  };
  struct {
    unsigned :13;
    unsigned TSIDL:1;
    unsigned :1;
    unsigned TON:1;
  };
  struct {
    unsigned w:32;
  };
} __T9CONbits_t;
extern volatile __T9CONbits_t T9CONbits __asm__ ("T9CON") __attribute__((section("sfrs")));
extern volatile unsigned int        T9CONCLR __attribute__((section("sfrs")));
extern volatile unsigned int        T9CONSET __attribute__((section("sfrs")));
extern volatile unsigned int        T9CONINV __attribute__((section("sfrs")));
#define TMR9 TMR9
extern volatile unsigned int   TMR9 __attribute__((section("sfrs")));
extern volatile unsigned int        TMR9CLR __attribute__((section("sfrs")));
extern volatile unsigned int        TMR9SET __attribute__((section("sfrs")));
extern volatile unsigned int        TMR9INV __attribute__((section("sfrs")));
#define PR9 PR9
extern volatile unsigned int   PR9 __attribute__((section("sfrs")));
extern volatile unsigned int        PR9CLR __attribute__((section("sfrs")));
extern volatile unsigned int        PR9SET __attribute__((section("sfrs")));
extern volatile unsigned int        PR9INV __attribute__((section("sfrs")));
#define IC1CON IC1CON
extern volatile unsigned int   IC1CON __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned ICM:3;
    unsigned ICBNE:1;
    unsigned ICOV:1;
    unsigned ICI:2;
    unsigned ICTMR:1;
    unsigned C32:1;
    unsigned FEDGE:1;
    unsigned :3;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned ICM0:1;
    unsigned ICM1:1;
    unsigned ICM2:1;
    unsigned :2;
    unsigned ICI0:1;
    unsigned ICI1:1;
  };
  struct {
    unsigned :13;
    unsigned ICSIDL:1;
  };
  struct {
    unsigned w:32;
  };
} __IC1CONbits_t;
extern volatile __IC1CONbits_t IC1CONbits __asm__ ("IC1CON") __attribute__((section("sfrs")));
extern volatile unsigned int        IC1CONCLR __attribute__((section("sfrs")));
extern volatile unsigned int        IC1CONSET __attribute__((section("sfrs")));
extern volatile unsigned int        IC1CONINV __attribute__((section("sfrs")));
#define IC1BUF IC1BUF
extern volatile unsigned int   IC1BUF __attribute__((section("sfrs")));
#define IC2CON IC2CON
extern volatile unsigned int   IC2CON __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned ICM:3;
    unsigned ICBNE:1;
    unsigned ICOV:1;
    unsigned ICI:2;
    unsigned ICTMR:1;
    unsigned C32:1;
    unsigned FEDGE:1;
    unsigned :3;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned ICM0:1;
    unsigned ICM1:1;
    unsigned ICM2:1;
    unsigned :2;
    unsigned ICI0:1;
    unsigned ICI1:1;
  };
  struct {
    unsigned :13;
    unsigned ICSIDL:1;
  };
  struct {
    unsigned w:32;
  };
} __IC2CONbits_t;
