RIOT-OS/RIOT/boards/pic32-wifire/include/p32mz2048efg100.h
extern volatile __OC5CONbits_t OC5CONbits __asm__ ("OC5CON") __attribute__((section("sfrs")));
extern volatile unsigned int        OC5CONCLR __attribute__((section("sfrs")));
extern volatile unsigned int        OC5CONSET __attribute__((section("sfrs")));
extern volatile unsigned int        OC5CONINV __attribute__((section("sfrs")));
#define OC5R OC5R
extern volatile unsigned int   OC5R __attribute__((section("sfrs")));
extern volatile unsigned int        OC5RCLR __attribute__((section("sfrs")));
extern volatile unsigned int        OC5RSET __attribute__((section("sfrs")));
extern volatile unsigned int        OC5RINV __attribute__((section("sfrs")));
#define OC5RS OC5RS
extern volatile unsigned int   OC5RS __attribute__((section("sfrs")));
extern volatile unsigned int        OC5RSCLR __attribute__((section("sfrs")));
extern volatile unsigned int        OC5RSSET __attribute__((section("sfrs")));
extern volatile unsigned int        OC5RSINV __attribute__((section("sfrs")));
#define OC6CON OC6CON
extern volatile unsigned int   OC6CON __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned OCM:3;
    unsigned OCTSEL:1;
    unsigned OCFLT:1;
    unsigned OC32:1;
    unsigned :7;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned OCM0:1;
    unsigned OCM1:1;
    unsigned OCM2:1;
  };
  struct {
    unsigned :13;
    unsigned OCSIDL:1;
  };
  struct {
    unsigned w:32;
  };
} __OC6CONbits_t;
extern volatile __OC6CONbits_t OC6CONbits __asm__ ("OC6CON") __attribute__((section("sfrs")));
extern volatile unsigned int        OC6CONCLR __attribute__((section("sfrs")));
extern volatile unsigned int        OC6CONSET __attribute__((section("sfrs")));
extern volatile unsigned int        OC6CONINV __attribute__((section("sfrs")));
#define OC6R OC6R
extern volatile unsigned int   OC6R __attribute__((section("sfrs")));
extern volatile unsigned int        OC6RCLR __attribute__((section("sfrs")));
extern volatile unsigned int        OC6RSET __attribute__((section("sfrs")));
extern volatile unsigned int        OC6RINV __attribute__((section("sfrs")));
#define OC6RS OC6RS
extern volatile unsigned int   OC6RS __attribute__((section("sfrs")));
extern volatile unsigned int        OC6RSCLR __attribute__((section("sfrs")));
extern volatile unsigned int        OC6RSSET __attribute__((section("sfrs")));
extern volatile unsigned int        OC6RSINV __attribute__((section("sfrs")));
#define OC7CON OC7CON
extern volatile unsigned int   OC7CON __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned OCM:3;
    unsigned OCTSEL:1;
    unsigned OCFLT:1;
    unsigned OC32:1;
    unsigned :7;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned OCM0:1;
    unsigned OCM1:1;
    unsigned OCM2:1;
  };
  struct {
    unsigned :13;
    unsigned OCSIDL:1;
  };
  struct {
    unsigned w:32;
  };
} __OC7CONbits_t;
extern volatile __OC7CONbits_t OC7CONbits __asm__ ("OC7CON") __attribute__((section("sfrs")));
extern volatile unsigned int        OC7CONCLR __attribute__((section("sfrs")));
extern volatile unsigned int        OC7CONSET __attribute__((section("sfrs")));
extern volatile unsigned int        OC7CONINV __attribute__((section("sfrs")));
#define OC7R OC7R
extern volatile unsigned int   OC7R __attribute__((section("sfrs")));
extern volatile unsigned int        OC7RCLR __attribute__((section("sfrs")));
extern volatile unsigned int        OC7RSET __attribute__((section("sfrs")));
extern volatile unsigned int        OC7RINV __attribute__((section("sfrs")));
#define OC7RS OC7RS
extern volatile unsigned int   OC7RS __attribute__((section("sfrs")));
extern volatile unsigned int        OC7RSCLR __attribute__((section("sfrs")));
extern volatile unsigned int        OC7RSSET __attribute__((section("sfrs")));
extern volatile unsigned int        OC7RSINV __attribute__((section("sfrs")));
#define OC8CON OC8CON
extern volatile unsigned int   OC8CON __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned OCM:3;
    unsigned OCTSEL:1;
    unsigned OCFLT:1;
    unsigned OC32:1;
    unsigned :7;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned OCM0:1;
    unsigned OCM1:1;
    unsigned OCM2:1;
  };
  struct {
    unsigned :13;
    unsigned OCSIDL:1;
  };
  struct {
    unsigned w:32;
  };
} __OC8CONbits_t;
extern volatile __OC8CONbits_t OC8CONbits __asm__ ("OC8CON") __attribute__((section("sfrs")));
extern volatile unsigned int        OC8CONCLR __attribute__((section("sfrs")));
extern volatile unsigned int        OC8CONSET __attribute__((section("sfrs")));
extern volatile unsigned int        OC8CONINV __attribute__((section("sfrs")));
#define OC8R OC8R
extern volatile unsigned int   OC8R __attribute__((section("sfrs")));
extern volatile unsigned int        OC8RCLR __attribute__((section("sfrs")));
extern volatile unsigned int        OC8RSET __attribute__((section("sfrs")));
extern volatile unsigned int        OC8RINV __attribute__((section("sfrs")));
#define OC8RS OC8RS
extern volatile unsigned int   OC8RS __attribute__((section("sfrs")));
extern volatile unsigned int        OC8RSCLR __attribute__((section("sfrs")));
extern volatile unsigned int        OC8RSSET __attribute__((section("sfrs")));
extern volatile unsigned int        OC8RSINV __attribute__((section("sfrs")));
#define OC9CON OC9CON
extern volatile unsigned int   OC9CON __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned OCM:3;
    unsigned OCTSEL:1;
    unsigned OCFLT:1;
    unsigned OC32:1;
    unsigned :7;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned OCM0:1;
    unsigned OCM1:1;
    unsigned OCM2:1;
  };
  struct {
    unsigned :13;
    unsigned OCSIDL:1;
  };
  struct {
    unsigned w:32;
  };
} __OC9CONbits_t;
extern volatile __OC9CONbits_t OC9CONbits __asm__ ("OC9CON") __attribute__((section("sfrs")));
extern volatile unsigned int        OC9CONCLR __attribute__((section("sfrs")));
extern volatile unsigned int        OC9CONSET __attribute__((section("sfrs")));
extern volatile unsigned int        OC9CONINV __attribute__((section("sfrs")));
#define OC9R OC9R
extern volatile unsigned int   OC9R __attribute__((section("sfrs")));
extern volatile unsigned int        OC9RCLR __attribute__((section("sfrs")));
extern volatile unsigned int        OC9RSET __attribute__((section("sfrs")));
extern volatile unsigned int        OC9RINV __attribute__((section("sfrs")));
#define OC9RS OC9RS
extern volatile unsigned int   OC9RS __attribute__((section("sfrs")));
extern volatile unsigned int        OC9RSCLR __attribute__((section("sfrs")));
extern volatile unsigned int        OC9RSSET __attribute__((section("sfrs")));
extern volatile unsigned int        OC9RSINV __attribute__((section("sfrs")));
#define ADCCON1 ADCCON1
extern volatile unsigned int   ADCCON1 __attribute__((section("sfrs")));
typedef struct {
  unsigned :3;
  unsigned STRGLVL:1;
  unsigned IRQVS:3;
  unsigned :2;
  unsigned FSPBCLKEN:1;
  unsigned FSSCLKEN:1;
  unsigned CVDEN:1;
  unsigned AICPMPEN:1;
  unsigned SIDL:1;
  unsigned :1;
  unsigned ON:1;
  unsigned STRGSRC:5;
  unsigned SELRES:2;
  unsigned FRACT:1;
  unsigned TRBSLV:3;
  unsigned TRBMST:3;
  unsigned TRBERR:1;
  unsigned TRBEN:1;
} __ADCCON1bits_t;
