RIOT-OS/RIOT/boards/pic32-wifire/include/p32mz2048efg100.h
extern volatile __ADEVCFG3bits_t ADEVCFG3bits __asm__ ("ADEVCFG3") __attribute__((section("sfrs")));
#define ADEVCFG2 ADEVCFG2
extern volatile unsigned int   ADEVCFG2 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned FPLLIDIV:3;
    unsigned :1;
    unsigned FPLLRNG:3;
    unsigned FPLLICLK:1;
    unsigned FPLLMULT:7;
    unsigned :1;
    unsigned FPLLODIV:3;
    unsigned :11;
    unsigned UPLLFSEL:1;
  };
  struct {
    unsigned w:32;
  };
} __ADEVCFG2bits_t;
extern volatile __ADEVCFG2bits_t ADEVCFG2bits __asm__ ("ADEVCFG2") __attribute__((section("sfrs")));
#define ADEVCFG1 ADEVCFG1
extern volatile unsigned int   ADEVCFG1 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned FNOSC:3;
    unsigned DMTINTV:3;
    unsigned FSOSCEN:1;
    unsigned IESO:1;
    unsigned POSCMOD:2;
    unsigned OSCIOFNC:1;
    unsigned :3;
    unsigned FCKSM:2;
    unsigned WDTPS:5;
    unsigned WDTSPGM:1;
    unsigned WINDIS:1;
    unsigned FWDTEN:1;
    unsigned FWDTWINSZ:2;
    unsigned DMTCNT:5;
    unsigned FDMTEN:1;
  };
  struct {
    unsigned w:32;
  };
} __ADEVCFG1bits_t;
extern volatile __ADEVCFG1bits_t ADEVCFG1bits __asm__ ("ADEVCFG1") __attribute__((section("sfrs")));
#define ADEVCFG0 ADEVCFG0
extern volatile unsigned int   ADEVCFG0 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned DEBUG:2;
    unsigned JTAGEN:1;
    unsigned ICESEL:2;
    unsigned TRCEN:1;
    unsigned BOOTISA:1;
    unsigned :1;
    unsigned FECCCON:2;
    unsigned FSLEEP:1;
    unsigned :1;
    unsigned DBGPER:3;
    unsigned SMCLR:1;
    unsigned SOSCGAIN:2;
    unsigned SOSCBOOST:1;
    unsigned POSCGAIN:2;
    unsigned POSCBOOST:1;
    unsigned :8;
    unsigned EJTAGBEN:1;
  };
  struct {
    unsigned FDEBUG:2;
  };
  struct {
    unsigned w:32;
  };
} __ADEVCFG0bits_t;
extern volatile __ADEVCFG0bits_t ADEVCFG0bits __asm__ ("ADEVCFG0") __attribute__((section("sfrs")));
#define ADEVCP3 ADEVCP3
extern volatile unsigned int   ADEVCP3 __attribute__((section("sfrs")));
#define ADEVCP2 ADEVCP2
extern volatile unsigned int   ADEVCP2 __attribute__((section("sfrs")));
#define ADEVCP1 ADEVCP1
extern volatile unsigned int   ADEVCP1 __attribute__((section("sfrs")));
#define ADEVCP0 ADEVCP0
extern volatile unsigned int   ADEVCP0 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :28;
    unsigned CP:1;
  };
  struct {
    unsigned w:32;
  };
} __ADEVCP0bits_t;
extern volatile __ADEVCP0bits_t ADEVCP0bits __asm__ ("ADEVCP0") __attribute__((section("sfrs")));
#define ADEVSIGN3 ADEVSIGN3
extern volatile unsigned int   ADEVSIGN3 __attribute__((section("sfrs")));
#define ADEVSIGN2 ADEVSIGN2
extern volatile unsigned int   ADEVSIGN2 __attribute__((section("sfrs")));
#define ADEVSIGN1 ADEVSIGN1
extern volatile unsigned int   ADEVSIGN1 __attribute__((section("sfrs")));
#define ADEVSIGN0 ADEVSIGN0
extern volatile unsigned int   ADEVSIGN0 __attribute__((section("sfrs")));
#define ASEQ3 ASEQ3
extern volatile unsigned int   ASEQ3 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned TSEQ:16;
    unsigned CSEQ:16;
  };
  struct {
    unsigned w:32;
  };
} __ASEQ3bits_t;
extern volatile __ASEQ3bits_t ASEQ3bits __asm__ ("ASEQ3") __attribute__((section("sfrs")));
#define ASEQ2 ASEQ2
extern volatile unsigned int   ASEQ2 __attribute__((section("sfrs")));
#define ASEQ1 ASEQ1
extern volatile unsigned int   ASEQ1 __attribute__((section("sfrs")));
#define ASEQ0 ASEQ0
extern volatile unsigned int   ASEQ0 __attribute__((section("sfrs")));
#define AUBADEVCFG3 AUBADEVCFG3
extern volatile unsigned int   AUBADEVCFG3 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned USERID:16;
    unsigned :8;
    unsigned FMIIEN:1;
    unsigned FETHIO:1;
    unsigned :1;
    unsigned PGL1WAY:1;
    unsigned PMDL1WAY:1;
    unsigned IOL1WAY:1;
    unsigned FUSBIDIO:1;
  };
  struct {
    unsigned w:32;
  };
} __AUBADEVCFG3bits_t;
extern volatile __AUBADEVCFG3bits_t AUBADEVCFG3bits __asm__ ("AUBADEVCFG3") __attribute__((section("sfrs")));
#define AUBADEVCFG2 AUBADEVCFG2
extern volatile unsigned int   AUBADEVCFG2 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned FPLLIDIV:3;
    unsigned :1;
    unsigned FPLLRNG:3;
    unsigned FPLLICLK:1;
    unsigned FPLLMULT:7;
    unsigned :1;
    unsigned FPLLODIV:3;
    unsigned :11;
    unsigned UPLLFSEL:1;
  };
  struct {
    unsigned w:32;
  };
} __AUBADEVCFG2bits_t;
extern volatile __AUBADEVCFG2bits_t AUBADEVCFG2bits __asm__ ("AUBADEVCFG2") __attribute__((section("sfrs")));
#define AUBADEVCFG1 AUBADEVCFG1
extern volatile unsigned int   AUBADEVCFG1 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned FNOSC:3;
    unsigned DMTINTV:3;
    unsigned FSOSCEN:1;
    unsigned IESO:1;
    unsigned POSCMOD:2;
    unsigned OSCIOFNC:1;
    unsigned :3;
    unsigned FCKSM:2;
    unsigned WDTPS:5;
    unsigned WDTSPGM:1;
    unsigned WINDIS:1;
    unsigned FWDTEN:1;
    unsigned FWDTWINSZ:2;
    unsigned DMTCNT:5;
    unsigned FDMTEN:1;
  };
  struct {
    unsigned w:32;
  };
} __AUBADEVCFG1bits_t;
extern volatile __AUBADEVCFG1bits_t AUBADEVCFG1bits __asm__ ("AUBADEVCFG1") __attribute__((section("sfrs")));
#define AUBADEVCFG0 AUBADEVCFG0
extern volatile unsigned int   AUBADEVCFG0 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned DEBUG:2;
    unsigned JTAGEN:1;
    unsigned ICESEL:2;
    unsigned TRCEN:1;
    unsigned BOOTISA:1;
    unsigned :1;
    unsigned FECCCON:2;
    unsigned FSLEEP:1;
    unsigned :1;
    unsigned DBGPER:3;
    unsigned SMCLR:1;
    unsigned SOSCGAIN:2;
    unsigned SOSCBOOST:1;
    unsigned POSCGAIN:2;
    unsigned POSCBOOST:1;
    unsigned :8;
    unsigned EJTAGBEN:1;
  };
  struct {
    unsigned FDEBUG:2;
  };
  struct {
    unsigned w:32;
  };
} __AUBADEVCFG0bits_t;
extern volatile __AUBADEVCFG0bits_t AUBADEVCFG0bits __asm__ ("AUBADEVCFG0") __attribute__((section("sfrs")));
#define AUBADEVCP3 AUBADEVCP3
extern volatile unsigned int   AUBADEVCP3 __attribute__((section("sfrs")));
#define AUBADEVCP2 AUBADEVCP2
extern volatile unsigned int   AUBADEVCP2 __attribute__((section("sfrs")));
#define AUBADEVCP1 AUBADEVCP1
extern volatile unsigned int   AUBADEVCP1 __attribute__((section("sfrs")));
#define AUBADEVCP0 AUBADEVCP0
extern volatile unsigned int   AUBADEVCP0 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :28;
    unsigned CP:1;
  };
  struct {
    unsigned w:32;
  };
} __AUBADEVCP0bits_t;
extern volatile __AUBADEVCP0bits_t AUBADEVCP0bits __asm__ ("AUBADEVCP0") __attribute__((section("sfrs")));
#define AUBADEVSIGN3 AUBADEVSIGN3
extern volatile unsigned int   AUBADEVSIGN3 __attribute__((section("sfrs")));
#define AUBADEVSIGN2 AUBADEVSIGN2
extern volatile unsigned int   AUBADEVSIGN2 __attribute__((section("sfrs")));
#define AUBADEVSIGN1 AUBADEVSIGN1
extern volatile unsigned int   AUBADEVSIGN1 __attribute__((section("sfrs")));
#define AUBADEVSIGN0 AUBADEVSIGN0
extern volatile unsigned int   AUBADEVSIGN0 __attribute__((section("sfrs")));
#define AUBASEQ3 AUBASEQ3
extern volatile unsigned int   AUBASEQ3 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned TSEQ:16;
    unsigned CSEQ:16;
  };
  struct {
    unsigned w:32;
  };
} __AUBASEQ3bits_t;
extern volatile __AUBASEQ3bits_t AUBASEQ3bits __asm__ ("AUBASEQ3") __attribute__((section("sfrs")));
#define AUBASEQ2 AUBASEQ2
extern volatile unsigned int   AUBASEQ2 __attribute__((section("sfrs")));
#define AUBASEQ1 AUBASEQ1
extern volatile unsigned int   AUBASEQ1 __attribute__((section("sfrs")));
#define AUBASEQ0 AUBASEQ0
extern volatile unsigned int   AUBASEQ0 __attribute__((section("sfrs")));
#define UBADEVCFG3 UBADEVCFG3
extern volatile unsigned int   UBADEVCFG3 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned USERID:16;
    unsigned :8;
    unsigned FMIIEN:1;
    unsigned FETHIO:1;
    unsigned :1;
    unsigned PGL1WAY:1;
    unsigned PMDL1WAY:1;
    unsigned IOL1WAY:1;
    unsigned FUSBIDIO:1;
  };
  struct {
    unsigned w:32;
  };
} __UBADEVCFG3bits_t;
