RIOT-OS/RIOT/boards/pic32-wifire/include/p32mz2048efg100.h
extern volatile __UBADEVCFG3bits_t UBADEVCFG3bits __asm__ ("UBADEVCFG3") __attribute__((section("sfrs")));
#define UBADEVCFG2 UBADEVCFG2
extern volatile unsigned int   UBADEVCFG2 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned FPLLIDIV:3;
    unsigned :1;
    unsigned FPLLRNG:3;
    unsigned FPLLICLK:1;
    unsigned FPLLMULT:7;
    unsigned :1;
    unsigned FPLLODIV:3;
    unsigned :11;
    unsigned UPLLFSEL:1;
  };
  struct {
    unsigned w:32;
  };
} __UBADEVCFG2bits_t;
extern volatile __UBADEVCFG2bits_t UBADEVCFG2bits __asm__ ("UBADEVCFG2") __attribute__((section("sfrs")));
#define UBADEVCFG1 UBADEVCFG1
extern volatile unsigned int   UBADEVCFG1 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned FNOSC:3;
    unsigned DMTINTV:3;
    unsigned FSOSCEN:1;
    unsigned IESO:1;
    unsigned POSCMOD:2;
    unsigned OSCIOFNC:1;
    unsigned :3;
    unsigned FCKSM:2;
    unsigned WDTPS:5;
    unsigned WDTSPGM:1;
    unsigned WINDIS:1;
    unsigned FWDTEN:1;
    unsigned FWDTWINSZ:2;
    unsigned DMTCNT:5;
    unsigned FDMTEN:1;
  };
  struct {
    unsigned w:32;
  };
} __UBADEVCFG1bits_t;
extern volatile __UBADEVCFG1bits_t UBADEVCFG1bits __asm__ ("UBADEVCFG1") __attribute__((section("sfrs")));
#define UBADEVCFG0 UBADEVCFG0
extern volatile unsigned int   UBADEVCFG0 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned DEBUG:2;
    unsigned JTAGEN:1;
    unsigned ICESEL:2;
    unsigned TRCEN:1;
    unsigned BOOTISA:1;
    unsigned :1;
    unsigned FECCCON:2;
    unsigned FSLEEP:1;
    unsigned :1;
    unsigned DBGPER:3;
    unsigned SMCLR:1;
    unsigned SOSCGAIN:2;
    unsigned SOSCBOOST:1;
    unsigned POSCGAIN:2;
    unsigned POSCBOOST:1;
    unsigned :8;
    unsigned EJTAGBEN:1;
  };
  struct {
    unsigned FDEBUG:2;
  };
  struct {
    unsigned w:32;
  };
} __UBADEVCFG0bits_t;
extern volatile __UBADEVCFG0bits_t UBADEVCFG0bits __asm__ ("UBADEVCFG0") __attribute__((section("sfrs")));
#define UBADEVCP3 UBADEVCP3
extern volatile unsigned int   UBADEVCP3 __attribute__((section("sfrs")));
#define UBADEVCP2 UBADEVCP2
extern volatile unsigned int   UBADEVCP2 __attribute__((section("sfrs")));
#define UBADEVCP1 UBADEVCP1
extern volatile unsigned int   UBADEVCP1 __attribute__((section("sfrs")));
#define UBADEVCP0 UBADEVCP0
extern volatile unsigned int   UBADEVCP0 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :28;
    unsigned CP:1;
  };
  struct {
    unsigned w:32;
  };
} __UBADEVCP0bits_t;
extern volatile __UBADEVCP0bits_t UBADEVCP0bits __asm__ ("UBADEVCP0") __attribute__((section("sfrs")));
#define UBADEVSIGN3 UBADEVSIGN3
extern volatile unsigned int   UBADEVSIGN3 __attribute__((section("sfrs")));
#define UBADEVSIGN2 UBADEVSIGN2
extern volatile unsigned int   UBADEVSIGN2 __attribute__((section("sfrs")));
#define UBADEVSIGN1 UBADEVSIGN1
extern volatile unsigned int   UBADEVSIGN1 __attribute__((section("sfrs")));
#define UBADEVSIGN0 UBADEVSIGN0
extern volatile unsigned int   UBADEVSIGN0 __attribute__((section("sfrs")));
#define UBASEQ3 UBASEQ3
extern volatile unsigned int   UBASEQ3 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned TSEQ:16;
    unsigned CSEQ:16;
  };
  struct {
    unsigned w:32;
  };
} __UBASEQ3bits_t;
extern volatile __UBASEQ3bits_t UBASEQ3bits __asm__ ("UBASEQ3") __attribute__((section("sfrs")));
#define UBASEQ2 UBASEQ2
extern volatile unsigned int   UBASEQ2 __attribute__((section("sfrs")));
#define UBASEQ1 UBASEQ1
extern volatile unsigned int   UBASEQ1 __attribute__((section("sfrs")));
#define UBASEQ0 UBASEQ0
extern volatile unsigned int   UBASEQ0 __attribute__((section("sfrs")));
#define ABF1DEVCFG3 ABF1DEVCFG3
extern volatile unsigned int   ABF1DEVCFG3 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned USERID:16;
    unsigned :8;
    unsigned FMIIEN:1;
    unsigned FETHIO:1;
    unsigned :1;
    unsigned PGL1WAY:1;
    unsigned PMDL1WAY:1;
    unsigned IOL1WAY:1;
    unsigned FUSBIDIO:1;
  };
  struct {
    unsigned w:32;
  };
} __ABF1DEVCFG3bits_t;
extern volatile __ABF1DEVCFG3bits_t ABF1DEVCFG3bits __asm__ ("ABF1DEVCFG3") __attribute__((section("sfrs")));
#define ABF1DEVCFG2 ABF1DEVCFG2
extern volatile unsigned int   ABF1DEVCFG2 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned FPLLIDIV:3;
    unsigned :1;
    unsigned FPLLRNG:3;
    unsigned FPLLICLK:1;
    unsigned FPLLMULT:7;
    unsigned :1;
    unsigned FPLLODIV:3;
    unsigned :11;
    unsigned UPLLFSEL:1;
  };
  struct {
    unsigned w:32;
  };
} __ABF1DEVCFG2bits_t;
extern volatile __ABF1DEVCFG2bits_t ABF1DEVCFG2bits __asm__ ("ABF1DEVCFG2") __attribute__((section("sfrs")));
#define ABF1DEVCFG1 ABF1DEVCFG1
extern volatile unsigned int   ABF1DEVCFG1 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned FNOSC:3;
    unsigned DMTINTV:3;
    unsigned FSOSCEN:1;
    unsigned IESO:1;
    unsigned POSCMOD:2;
    unsigned OSCIOFNC:1;
    unsigned :3;
    unsigned FCKSM:2;
    unsigned WDTPS:5;
    unsigned WDTSPGM:1;
    unsigned WINDIS:1;
    unsigned FWDTEN:1;
    unsigned FWDTWINSZ:2;
    unsigned DMTCNT:5;
    unsigned FDMTEN:1;
  };
  struct {
    unsigned w:32;
  };
} __ABF1DEVCFG1bits_t;
extern volatile __ABF1DEVCFG1bits_t ABF1DEVCFG1bits __asm__ ("ABF1DEVCFG1") __attribute__((section("sfrs")));
#define ABF1DEVCFG0 ABF1DEVCFG0
extern volatile unsigned int   ABF1DEVCFG0 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned DEBUG:2;
    unsigned JTAGEN:1;
    unsigned ICESEL:2;
    unsigned TRCEN:1;
    unsigned BOOTISA:1;
    unsigned :1;
    unsigned FECCCON:2;
    unsigned FSLEEP:1;
    unsigned :1;
    unsigned DBGPER:3;
    unsigned SMCLR:1;
    unsigned SOSCGAIN:2;
    unsigned SOSCBOOST:1;
    unsigned POSCGAIN:2;
    unsigned POSCBOOST:1;
    unsigned :8;
    unsigned EJTAGBEN:1;
  };
  struct {
    unsigned FDEBUG:2;
  };
  struct {
    unsigned w:32;
  };
} __ABF1DEVCFG0bits_t;
extern volatile __ABF1DEVCFG0bits_t ABF1DEVCFG0bits __asm__ ("ABF1DEVCFG0") __attribute__((section("sfrs")));
#define ABF1DEVCP3 ABF1DEVCP3
extern volatile unsigned int   ABF1DEVCP3 __attribute__((section("sfrs")));
#define ABF1DEVCP2 ABF1DEVCP2
extern volatile unsigned int   ABF1DEVCP2 __attribute__((section("sfrs")));
#define ABF1DEVCP1 ABF1DEVCP1
extern volatile unsigned int   ABF1DEVCP1 __attribute__((section("sfrs")));
#define ABF1DEVCP0 ABF1DEVCP0
extern volatile unsigned int   ABF1DEVCP0 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :28;
    unsigned CP:1;
  };
  struct {
    unsigned w:32;
  };
} __ABF1DEVCP0bits_t;
extern volatile __ABF1DEVCP0bits_t ABF1DEVCP0bits __asm__ ("ABF1DEVCP0") __attribute__((section("sfrs")));
#define ABF1DEVSIGN3 ABF1DEVSIGN3
extern volatile unsigned int   ABF1DEVSIGN3 __attribute__((section("sfrs")));
#define ABF1DEVSIGN2 ABF1DEVSIGN2
extern volatile unsigned int   ABF1DEVSIGN2 __attribute__((section("sfrs")));
#define ABF1DEVSIGN1 ABF1DEVSIGN1
extern volatile unsigned int   ABF1DEVSIGN1 __attribute__((section("sfrs")));
#define ABF1DEVSIGN0 ABF1DEVSIGN0
extern volatile unsigned int   ABF1DEVSIGN0 __attribute__((section("sfrs")));
#define ABF1SEQ3 ABF1SEQ3
extern volatile unsigned int   ABF1SEQ3 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned TSEQ:16;
    unsigned CSEQ:16;
  };
  struct {
    unsigned w:32;
  };
} __ABF1SEQ3bits_t;
extern volatile __ABF1SEQ3bits_t ABF1SEQ3bits __asm__ ("ABF1SEQ3") __attribute__((section("sfrs")));
#define ABF1SEQ2 ABF1SEQ2
extern volatile unsigned int   ABF1SEQ2 __attribute__((section("sfrs")));
#define ABF1SEQ1 ABF1SEQ1
extern volatile unsigned int   ABF1SEQ1 __attribute__((section("sfrs")));
#define ABF1SEQ0 ABF1SEQ0
extern volatile unsigned int   ABF1SEQ0 __attribute__((section("sfrs")));
#define BF1DEVCFG3 BF1DEVCFG3
extern volatile unsigned int   BF1DEVCFG3 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned USERID:16;
    unsigned :8;
    unsigned FMIIEN:1;
    unsigned FETHIO:1;
    unsigned :1;
    unsigned PGL1WAY:1;
    unsigned PMDL1WAY:1;
    unsigned IOL1WAY:1;
    unsigned FUSBIDIO:1;
  };
  struct {
    unsigned w:32;
  };
} __BF1DEVCFG3bits_t;
extern volatile __BF1DEVCFG3bits_t BF1DEVCFG3bits __asm__ ("BF1DEVCFG3") __attribute__((section("sfrs")));
#define BF1DEVCFG2 BF1DEVCFG2
extern volatile unsigned int   BF1DEVCFG2 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned FPLLIDIV:3;
    unsigned :1;
    unsigned FPLLRNG:3;
    unsigned FPLLICLK:1;
    unsigned FPLLMULT:7;
    unsigned :1;
    unsigned FPLLODIV:3;
    unsigned :11;
    unsigned UPLLFSEL:1;
  };
  struct {
    unsigned w:32;
  };
} __BF1DEVCFG2bits_t;
extern volatile __BF1DEVCFG2bits_t BF1DEVCFG2bits __asm__ ("BF1DEVCFG2") __attribute__((section("sfrs")));
#define BF1DEVCFG1 BF1DEVCFG1
extern volatile unsigned int   BF1DEVCFG1 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned FNOSC:3;
    unsigned DMTINTV:3;
    unsigned FSOSCEN:1;
    unsigned IESO:1;
    unsigned POSCMOD:2;
    unsigned OSCIOFNC:1;
    unsigned :3;
    unsigned FCKSM:2;
    unsigned WDTPS:5;
    unsigned WDTSPGM:1;
    unsigned WINDIS:1;
    unsigned FWDTEN:1;
    unsigned FWDTWINSZ:2;
    unsigned DMTCNT:5;
    unsigned FDMTEN:1;
  };
  struct {
    unsigned w:32;
  };
} __BF1DEVCFG1bits_t;
extern volatile __BF1DEVCFG1bits_t BF1DEVCFG1bits __asm__ ("BF1DEVCFG1") __attribute__((section("sfrs")));
#define BF1DEVCFG0 BF1DEVCFG0
extern volatile unsigned int   BF1DEVCFG0 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned DEBUG:2;
    unsigned JTAGEN:1;
    unsigned ICESEL:2;
    unsigned TRCEN:1;
    unsigned BOOTISA:1;
    unsigned :1;
    unsigned FECCCON:2;
    unsigned FSLEEP:1;
    unsigned :1;
    unsigned DBGPER:3;
    unsigned SMCLR:1;
    unsigned SOSCGAIN:2;
    unsigned SOSCBOOST:1;
    unsigned POSCGAIN:2;
    unsigned POSCBOOST:1;
    unsigned :8;
    unsigned EJTAGBEN:1;
  };
  struct {
    unsigned FDEBUG:2;
  };
  struct {
    unsigned w:32;
  };
} __BF1DEVCFG0bits_t;
extern volatile __BF1DEVCFG0bits_t BF1DEVCFG0bits __asm__ ("BF1DEVCFG0") __attribute__((section("sfrs")));
#define BF1DEVCP3 BF1DEVCP3
extern volatile unsigned int   BF1DEVCP3 __attribute__((section("sfrs")));
#define BF1DEVCP2 BF1DEVCP2
extern volatile unsigned int   BF1DEVCP2 __attribute__((section("sfrs")));
#define BF1DEVCP1 BF1DEVCP1
extern volatile unsigned int   BF1DEVCP1 __attribute__((section("sfrs")));
#define BF1DEVCP0 BF1DEVCP0
extern volatile unsigned int   BF1DEVCP0 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :28;
    unsigned CP:1;
  };
  struct {
    unsigned w:32;
  };
} __BF1DEVCP0bits_t;
extern volatile __BF1DEVCP0bits_t BF1DEVCP0bits __asm__ ("BF1DEVCP0") __attribute__((section("sfrs")));
#define BF1DEVSIGN3 BF1DEVSIGN3
extern volatile unsigned int   BF1DEVSIGN3 __attribute__((section("sfrs")));
#define BF1DEVSIGN2 BF1DEVSIGN2
extern volatile unsigned int   BF1DEVSIGN2 __attribute__((section("sfrs")));
#define BF1DEVSIGN1 BF1DEVSIGN1
extern volatile unsigned int   BF1DEVSIGN1 __attribute__((section("sfrs")));
#define BF1DEVSIGN0 BF1DEVSIGN0
extern volatile unsigned int   BF1DEVSIGN0 __attribute__((section("sfrs")));
#define BF1SEQ3 BF1SEQ3
extern volatile unsigned int   BF1SEQ3 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned TSEQ:16;
    unsigned CSEQ:16;
  };
  struct {
    unsigned w:32;
  };
} __BF1SEQ3bits_t;
extern volatile __BF1SEQ3bits_t BF1SEQ3bits __asm__ ("BF1SEQ3") __attribute__((section("sfrs")));
#define BF1SEQ2 BF1SEQ2
extern volatile unsigned int   BF1SEQ2 __attribute__((section("sfrs")));
#define BF1SEQ1 BF1SEQ1
extern volatile unsigned int   BF1SEQ1 __attribute__((section("sfrs")));
#define BF1SEQ0 BF1SEQ0
extern volatile unsigned int   BF1SEQ0 __attribute__((section("sfrs")));
#define ABF2DEVCFG3 ABF2DEVCFG3
extern volatile unsigned int   ABF2DEVCFG3 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned USERID:16;
    unsigned :8;
    unsigned FMIIEN:1;
    unsigned FETHIO:1;
    unsigned :1;
    unsigned PGL1WAY:1;
    unsigned PMDL1WAY:1;
    unsigned IOL1WAY:1;
    unsigned FUSBIDIO:1;
  };
  struct {
    unsigned w:32;
  };
} __ABF2DEVCFG3bits_t;
