RIOT-OS/RIOT/boards/pic32-wifire/include/p32mz2048efg100.h
extern volatile __ABF2DEVCFG3bits_t ABF2DEVCFG3bits __asm__ ("ABF2DEVCFG3") __attribute__((section("sfrs")));
#define ABF2DEVCFG2 ABF2DEVCFG2
extern volatile unsigned int   ABF2DEVCFG2 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned FPLLIDIV:3;
    unsigned :1;
    unsigned FPLLRNG:3;
    unsigned FPLLICLK:1;
    unsigned FPLLMULT:7;
    unsigned :1;
    unsigned FPLLODIV:3;
    unsigned :11;
    unsigned UPLLFSEL:1;
  };
  struct {
    unsigned w:32;
  };
} __ABF2DEVCFG2bits_t;
extern volatile __ABF2DEVCFG2bits_t ABF2DEVCFG2bits __asm__ ("ABF2DEVCFG2") __attribute__((section("sfrs")));
#define ABF2DEVCFG1 ABF2DEVCFG1
extern volatile unsigned int   ABF2DEVCFG1 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned FNOSC:3;
    unsigned DMTINTV:3;
    unsigned FSOSCEN:1;
    unsigned IESO:1;
    unsigned POSCMOD:2;
    unsigned OSCIOFNC:1;
    unsigned :3;
    unsigned FCKSM:2;
    unsigned WDTPS:5;
    unsigned WDTSPGM:1;
    unsigned WINDIS:1;
    unsigned FWDTEN:1;
    unsigned FWDTWINSZ:2;
    unsigned DMTCNT:5;
    unsigned FDMTEN:1;
  };
  struct {
    unsigned w:32;
  };
} __ABF2DEVCFG1bits_t;
extern volatile __ABF2DEVCFG1bits_t ABF2DEVCFG1bits __asm__ ("ABF2DEVCFG1") __attribute__((section("sfrs")));
#define ABF2DEVCFG0 ABF2DEVCFG0
extern volatile unsigned int   ABF2DEVCFG0 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned DEBUG:2;
    unsigned JTAGEN:1;
    unsigned ICESEL:2;
    unsigned TRCEN:1;
    unsigned BOOTISA:1;
    unsigned :1;
    unsigned FECCCON:2;
    unsigned FSLEEP:1;
    unsigned :1;
    unsigned DBGPER:3;
    unsigned SMCLR:1;
    unsigned SOSCGAIN:2;
    unsigned SOSCBOOST:1;
    unsigned POSCGAIN:2;
    unsigned POSCBOOST:1;
    unsigned :8;
    unsigned EJTAGBEN:1;
  };
  struct {
    unsigned FDEBUG:2;
  };
  struct {
    unsigned w:32;
  };
} __ABF2DEVCFG0bits_t;
extern volatile __ABF2DEVCFG0bits_t ABF2DEVCFG0bits __asm__ ("ABF2DEVCFG0") __attribute__((section("sfrs")));
#define ABF2DEVCP3 ABF2DEVCP3
extern volatile unsigned int   ABF2DEVCP3 __attribute__((section("sfrs")));
#define ABF2DEVCP2 ABF2DEVCP2
extern volatile unsigned int   ABF2DEVCP2 __attribute__((section("sfrs")));
#define ABF2DEVCP1 ABF2DEVCP1
extern volatile unsigned int   ABF2DEVCP1 __attribute__((section("sfrs")));
#define ABF2DEVCP0 ABF2DEVCP0
extern volatile unsigned int   ABF2DEVCP0 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :28;
    unsigned CP:1;
  };
  struct {
    unsigned w:32;
  };
} __ABF2DEVCP0bits_t;
extern volatile __ABF2DEVCP0bits_t ABF2DEVCP0bits __asm__ ("ABF2DEVCP0") __attribute__((section("sfrs")));
#define ABF2DEVSIGN3 ABF2DEVSIGN3
extern volatile unsigned int   ABF2DEVSIGN3 __attribute__((section("sfrs")));
#define ABF2DEVSIGN2 ABF2DEVSIGN2
extern volatile unsigned int   ABF2DEVSIGN2 __attribute__((section("sfrs")));
#define ABF2DEVSIGN1 ABF2DEVSIGN1
extern volatile unsigned int   ABF2DEVSIGN1 __attribute__((section("sfrs")));
#define ABF2DEVSIGN0 ABF2DEVSIGN0
extern volatile unsigned int   ABF2DEVSIGN0 __attribute__((section("sfrs")));
#define ABF2SEQ3 ABF2SEQ3
extern volatile unsigned int   ABF2SEQ3 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned TSEQ:16;
    unsigned CSEQ:16;
  };
  struct {
    unsigned w:32;
  };
} __ABF2SEQ3bits_t;
extern volatile __ABF2SEQ3bits_t ABF2SEQ3bits __asm__ ("ABF2SEQ3") __attribute__((section("sfrs")));
#define ABF2SEQ2 ABF2SEQ2
extern volatile unsigned int   ABF2SEQ2 __attribute__((section("sfrs")));
#define ABF2SEQ1 ABF2SEQ1
extern volatile unsigned int   ABF2SEQ1 __attribute__((section("sfrs")));
#define ABF2SEQ0 ABF2SEQ0
extern volatile unsigned int   ABF2SEQ0 __attribute__((section("sfrs")));
#define BF2DEVCFG3 BF2DEVCFG3
extern volatile unsigned int   BF2DEVCFG3 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned USERID:16;
    unsigned :8;
    unsigned FMIIEN:1;
    unsigned FETHIO:1;
    unsigned :1;
    unsigned PGL1WAY:1;
    unsigned PMDL1WAY:1;
    unsigned IOL1WAY:1;
    unsigned FUSBIDIO:1;
  };
  struct {
    unsigned w:32;
  };
} __BF2DEVCFG3bits_t;
extern volatile __BF2DEVCFG3bits_t BF2DEVCFG3bits __asm__ ("BF2DEVCFG3") __attribute__((section("sfrs")));
#define BF2DEVCFG2 BF2DEVCFG2
extern volatile unsigned int   BF2DEVCFG2 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned FPLLIDIV:3;
    unsigned :1;
    unsigned FPLLRNG:3;
    unsigned FPLLICLK:1;
    unsigned FPLLMULT:7;
    unsigned :1;
    unsigned FPLLODIV:3;
    unsigned :11;
    unsigned UPLLFSEL:1;
  };
  struct {
    unsigned w:32;
  };
} __BF2DEVCFG2bits_t;
extern volatile __BF2DEVCFG2bits_t BF2DEVCFG2bits __asm__ ("BF2DEVCFG2") __attribute__((section("sfrs")));
#define BF2DEVCFG1 BF2DEVCFG1
extern volatile unsigned int   BF2DEVCFG1 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned FNOSC:3;
    unsigned DMTINTV:3;
    unsigned FSOSCEN:1;
    unsigned IESO:1;
    unsigned POSCMOD:2;
    unsigned OSCIOFNC:1;
    unsigned :3;
    unsigned FCKSM:2;
    unsigned WDTPS:5;
    unsigned WDTSPGM:1;
    unsigned WINDIS:1;
    unsigned FWDTEN:1;
    unsigned FWDTWINSZ:2;
    unsigned DMTCNT:5;
    unsigned FDMTEN:1;
  };
  struct {
    unsigned w:32;
  };
} __BF2DEVCFG1bits_t;
extern volatile __BF2DEVCFG1bits_t BF2DEVCFG1bits __asm__ ("BF2DEVCFG1") __attribute__((section("sfrs")));
#define BF2DEVCFG0 BF2DEVCFG0
extern volatile unsigned int   BF2DEVCFG0 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned DEBUG:2;
    unsigned JTAGEN:1;
    unsigned ICESEL:2;
    unsigned TRCEN:1;
    unsigned BOOTISA:1;
    unsigned :1;
    unsigned FECCCON:2;
    unsigned FSLEEP:1;
    unsigned :1;
    unsigned DBGPER:3;
    unsigned SMCLR:1;
    unsigned SOSCGAIN:2;
    unsigned SOSCBOOST:1;
    unsigned POSCGAIN:2;
    unsigned POSCBOOST:1;
    unsigned :8;
    unsigned EJTAGBEN:1;
  };
  struct {
    unsigned FDEBUG:2;
  };
  struct {
    unsigned w:32;
  };
} __BF2DEVCFG0bits_t;
extern volatile __BF2DEVCFG0bits_t BF2DEVCFG0bits __asm__ ("BF2DEVCFG0") __attribute__((section("sfrs")));
#define BF2DEVCP3 BF2DEVCP3
extern volatile unsigned int   BF2DEVCP3 __attribute__((section("sfrs")));
#define BF2DEVCP2 BF2DEVCP2
extern volatile unsigned int   BF2DEVCP2 __attribute__((section("sfrs")));
#define BF2DEVCP1 BF2DEVCP1
extern volatile unsigned int   BF2DEVCP1 __attribute__((section("sfrs")));
#define BF2DEVCP0 BF2DEVCP0
extern volatile unsigned int   BF2DEVCP0 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :28;
    unsigned CP:1;
  };
  struct {
    unsigned w:32;
  };
} __BF2DEVCP0bits_t;
extern volatile __BF2DEVCP0bits_t BF2DEVCP0bits __asm__ ("BF2DEVCP0") __attribute__((section("sfrs")));
#define BF2DEVSIGN3 BF2DEVSIGN3
extern volatile unsigned int   BF2DEVSIGN3 __attribute__((section("sfrs")));
#define BF2DEVSIGN2 BF2DEVSIGN2
extern volatile unsigned int   BF2DEVSIGN2 __attribute__((section("sfrs")));
#define BF2DEVSIGN1 BF2DEVSIGN1
extern volatile unsigned int   BF2DEVSIGN1 __attribute__((section("sfrs")));
#define BF2DEVSIGN0 BF2DEVSIGN0
extern volatile unsigned int   BF2DEVSIGN0 __attribute__((section("sfrs")));
#define BF2SEQ3 BF2SEQ3
extern volatile unsigned int   BF2SEQ3 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned TSEQ:16;
    unsigned CSEQ:16;
  };
  struct {
    unsigned w:32;
  };
} __BF2SEQ3bits_t;
extern volatile __BF2SEQ3bits_t BF2SEQ3bits __asm__ ("BF2SEQ3") __attribute__((section("sfrs")));
#define BF2SEQ2 BF2SEQ2
extern volatile unsigned int   BF2SEQ2 __attribute__((section("sfrs")));
#define BF2SEQ1 BF2SEQ1
extern volatile unsigned int   BF2SEQ1 __attribute__((section("sfrs")));
#define BF2SEQ0 BF2SEQ0
extern volatile unsigned int   BF2SEQ0 __attribute__((section("sfrs")));
#ifdef __cplusplus
}
#endif

