RIOT-OS/RIOT/boards/pic32-wifire/include/p32mz2048efg100.h
#define _U4MODE_BRGH_POSITION                    0x00000003
#define _U4MODE_BRGH_MASK                        0x00000008
#define _U4MODE_BRGH_LENGTH                      0x00000001

#define _U4MODE_RXINV_POSITION                   0x00000004
#define _U4MODE_RXINV_MASK                       0x00000010
#define _U4MODE_RXINV_LENGTH                     0x00000001

#define _U4MODE_ABAUD_POSITION                   0x00000005
#define _U4MODE_ABAUD_MASK                       0x00000020
#define _U4MODE_ABAUD_LENGTH                     0x00000001

#define _U4MODE_LPBACK_POSITION                  0x00000006
#define _U4MODE_LPBACK_MASK                      0x00000040
#define _U4MODE_LPBACK_LENGTH                    0x00000001

#define _U4MODE_WAKE_POSITION                    0x00000007
#define _U4MODE_WAKE_MASK                        0x00000080
#define _U4MODE_WAKE_LENGTH                      0x00000001

#define _U4MODE_UEN_POSITION                     0x00000008
#define _U4MODE_UEN_MASK                         0x00000300
#define _U4MODE_UEN_LENGTH                       0x00000002

#define _U4MODE_RTSMD_POSITION                   0x0000000B
#define _U4MODE_RTSMD_MASK                       0x00000800
#define _U4MODE_RTSMD_LENGTH                     0x00000001

#define _U4MODE_IREN_POSITION                    0x0000000C
#define _U4MODE_IREN_MASK                        0x00001000
#define _U4MODE_IREN_LENGTH                      0x00000001

#define _U4MODE_SIDL_POSITION                    0x0000000D
#define _U4MODE_SIDL_MASK                        0x00002000
#define _U4MODE_SIDL_LENGTH                      0x00000001

#define _U4MODE_ON_POSITION                      0x0000000F
#define _U4MODE_ON_MASK                          0x00008000
#define _U4MODE_ON_LENGTH                        0x00000001

#define _U4MODE_PDSEL0_POSITION                  0x00000001
#define _U4MODE_PDSEL0_MASK                      0x00000002
#define _U4MODE_PDSEL0_LENGTH                    0x00000001

#define _U4MODE_PDSEL1_POSITION                  0x00000002
#define _U4MODE_PDSEL1_MASK                      0x00000004
#define _U4MODE_PDSEL1_LENGTH                    0x00000001

#define _U4MODE_UEN0_POSITION                    0x00000008
#define _U4MODE_UEN0_MASK                        0x00000100
#define _U4MODE_UEN0_LENGTH                      0x00000001

#define _U4MODE_UEN1_POSITION                    0x00000009
#define _U4MODE_UEN1_MASK                        0x00000200
#define _U4MODE_UEN1_LENGTH                      0x00000001

#define _U4MODE_USIDL_POSITION                   0x0000000D
#define _U4MODE_USIDL_MASK                       0x00002000
#define _U4MODE_USIDL_LENGTH                     0x00000001

#define _U4MODE_UARTEN_POSITION                  0x0000000F
#define _U4MODE_UARTEN_MASK                      0x00008000
#define _U4MODE_UARTEN_LENGTH                    0x00000001

#define _U4MODE_w_POSITION                       0x00000000
#define _U4MODE_w_MASK                           0xFFFFFFFF
#define _U4MODE_w_LENGTH                         0x00000020

#define _UGHMODE_STSEL_POSITION                  0x00000000
#define _UGHMODE_STSEL_MASK                      0x00000001
#define _UGHMODE_STSEL_LENGTH                    0x00000001

#define _UGHMODE_PDSEL_POSITION                  0x00000001
#define _UGHMODE_PDSEL_MASK                      0x00000006
#define _UGHMODE_PDSEL_LENGTH                    0x00000002

#define _UGHMODE_BRGH_POSITION                   0x00000003
#define _UGHMODE_BRGH_MASK                       0x00000008
#define _UGHMODE_BRGH_LENGTH                     0x00000001

#define _UGHMODE_RXINV_POSITION                  0x00000004
#define _UGHMODE_RXINV_MASK                      0x00000010
#define _UGHMODE_RXINV_LENGTH                    0x00000001

#define _UGHMODE_ABAUD_POSITION                  0x00000005
#define _UGHMODE_ABAUD_MASK                      0x00000020
#define _UGHMODE_ABAUD_LENGTH                    0x00000001

#define _UGHMODE_LPBACK_POSITION                 0x00000006
#define _UGHMODE_LPBACK_MASK                     0x00000040
#define _UGHMODE_LPBACK_LENGTH                   0x00000001

#define _UGHMODE_WAKE_POSITION                   0x00000007
#define _UGHMODE_WAKE_MASK                       0x00000080
#define _UGHMODE_WAKE_LENGTH                     0x00000001

#define _UGHMODE_UEN_POSITION                    0x00000008
#define _UGHMODE_UEN_MASK                        0x00000300
#define _UGHMODE_UEN_LENGTH                      0x00000002

#define _UGHMODE_RTSMD_POSITION                  0x0000000B
#define _UGHMODE_RTSMD_MASK                      0x00000800
#define _UGHMODE_RTSMD_LENGTH                    0x00000001

#define _UGHMODE_IREN_POSITION                   0x0000000C
#define _UGHMODE_IREN_MASK                       0x00001000
#define _UGHMODE_IREN_LENGTH                     0x00000001

#define _UGHMODE_SIDL_POSITION                   0x0000000D
#define _UGHMODE_SIDL_MASK                       0x00002000
#define _UGHMODE_SIDL_LENGTH                     0x00000001

#define _UGHMODE_ON_POSITION                     0x0000000F
#define _UGHMODE_ON_MASK                         0x00008000
#define _UGHMODE_ON_LENGTH                       0x00000001

#define _UGHMODE_PDSEL0_POSITION                 0x00000001
#define _UGHMODE_PDSEL0_MASK                     0x00000002
#define _UGHMODE_PDSEL0_LENGTH                   0x00000001

#define _UGHMODE_PDSEL1_POSITION                 0x00000002
#define _UGHMODE_PDSEL1_MASK                     0x00000004
#define _UGHMODE_PDSEL1_LENGTH                   0x00000001

#define _UGHMODE_UEN0_POSITION                   0x00000008
#define _UGHMODE_UEN0_MASK                       0x00000100
#define _UGHMODE_UEN0_LENGTH                     0x00000001

#define _UGHMODE_UEN1_POSITION                   0x00000009
#define _UGHMODE_UEN1_MASK                       0x00000200
#define _UGHMODE_UEN1_LENGTH                     0x00000001

#define _UGHMODE_USIDL_POSITION                  0x0000000D
#define _UGHMODE_USIDL_MASK                      0x00002000
#define _UGHMODE_USIDL_LENGTH                    0x00000001

